<strong><center>Awesome Chocolates<h2/><center/><strong/>

<strong>Introduction<strong/>

Awesome Chocolates is a chocolate company in America that sells various kinds of chocolate. Exploratory Data Analysis (EDA) using SQL is carried out with the aim of finding new information and answering questions such as how many units were sold, how many categories or brands were sold and how much revenue was earned and many other things. which is being explored.

1. <a style="text-decoration:none" href="#Connecting to MySQL Server">Connecting to MySQL Server<a/><br>
2. <a style="text-decoration:none" href="#Connecting to the Database">Connecting to the Database<a/><br>
3. <a style="text-decoration:none" href="#Creating a Query Execution Function">Creating a Query Execution Function<a/><br>
4. <a style="text-decoration:none" href="#Explorer Data Analyst">Explorer Data Analyst<a/><br>
    a. <a style="text-decoration:none" href="#show tables">show tables<a/><br>
    b. <a style="text-decoration:none" href="#describe">describe<a/><br>
    c. <a style="text-decoration:none" href="#select">select<a/><br>
    d. <a style="text-decoration:none" href="#disticnt">disticnt<a/><br>
    e. <a style="text-decoration:none" href="#join">join<a/><br>
    f. <a style="text-decoration:none" href="#aggregate functions">aggregate functions<a/><br>
    g. <a style="text-decoration:none" href="#operator">operator<a/><br>
    h. <a style="text-decoration:none" href="#like">like<a/><br>
    i. <a style="text-decoration:none" href="#case when">case when<a/><br>

In [1]:
import mysql.connector
from mysql.connector import Error

<strong id="Connecting to MySQL Server">Connecting to MySQL Server<strong/>

In [2]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

db = 'awesome chocolates'
pw = ''

connection = create_server_connection("localhost", "root", pw)

MySQL Database connection successful

<strong id="Connecting to the Database">Connecting to the Database<strong/>

In [3]:
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

In [4]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

<strong id="Creating a Query Execution Function">Creating a Query Execution Function<strong/>

In [5]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query successful")
    except Error as err:
        print(f"Error: '{err}'")

In [6]:
q1 = """
alter table sales 
MODIFY SaleDate date;;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q1)

for result in results:
  print(result)

MySQL Database connection successful

In [7]:
q2 = """
desc sales
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q2)

for result in results:
  print(result)

MySQL Database connection successful
('SPID', 'text', 'YES', '', None, '')
('GeoID', 'text', 'YES', '', None, '')
('PID', 'text', 'YES', '', None, '')
('SaleDate', 'date', 'YES', '', None, '')
('Amount', 'int(11)', 'YES', '', None, '')
('Customers', 'int(11)', 'YES', '', None, '')
('Boxes', 'int(11)', 'YES', '', None, '')

In [8]:
q3 = """
select SaleDate from sales
limit 5
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q3)

for result in results:
  print(result)

MySQL Database connection successful
(datetime.date(2001, 1, 21),)
(datetime.date(2001, 1, 21),)
(datetime.date(2001, 1, 21),)
(datetime.date(2001, 1, 21),)
(datetime.date(2001, 1, 21),)

<strong id="Explorer Data Analyst">Explorer Data Analyst<strong/>

<small id="show tables"> show tables <small/>

In [9]:
q4 = """
show tables;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q4)

for result in results:
  print(result)

MySQL Database connection successful
('geo',)
('people',)
('products',)
('sales',)

<small id="describe"> describe <small/>

In [10]:
q5 = """
desc geo;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q5)

for result in results:
  print(result)

MySQL Database connection successful
('GeoID', 'varchar(4)', 'NO', 'PRI', None, '')
('Geo', 'text', 'YES', '', None, '')
('Region', 'text', 'YES', '', None, '')

In [11]:
q6 = """
desc people;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q6)

for result in results:
  print(result)

MySQL Database connection successful
('Salesperson', 'text', 'YES', '', None, '')
('SPID', 'varchar(6)', 'NO', 'PRI', None, '')
('Team', 'text', 'YES', '', None, '')
('Location', 'text', 'YES', '', None, '')

In [12]:
q7 = """
desc products;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q7)

for result in results:
  print(result)

MySQL Database connection successful
('PID', 'varchar(6)', 'NO', 'PRI', None, '')
('Product', 'text', 'YES', '', None, '')
('Category', 'text', 'YES', '', None, '')
('Size', 'text', 'YES', '', None, '')
('Cost_per_box', 'double', 'YES', '', None, '')

In [15]:
q8 = """
desc sales;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q8)

for result in results:
  print(result)

MySQL Database connection successful
('SPID', 'text', 'YES', '', None, '')
('GeoID', 'text', 'YES', '', None, '')
('PID', 'text', 'YES', '', None, '')
('SaleDate', 'date', 'YES', '', None, '')
('Amount', 'int(11)', 'YES', '', None, '')
('Customers', 'int(11)', 'YES', '', None, '')
('Boxes', 'int(11)', 'YES', '', None, '')

<small id="select"> select <small/>

In [16]:
q9 = """
SELECT *
FROM geo;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q9)

for result in results:
  print(result)

MySQL Database connection successful
('G1', 'India', 'APAC')
('G2', 'USA', 'Americas')
('G3', 'Canada', 'Americas')
('G4', 'New Zealand', 'APAC')
('G5', 'Australia', 'APAC')
('G6', 'UK', 'Europe')

In [17]:
q10 = """
SELECT *
FROM products;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q10)

for result in results:
  print(result)

MySQL Database connection successful
('P01', 'Milk Bars', 'Bars', 'LARGE', 1.52)
('P02', '50% Dark Bites', 'Bites', 'LARGE', 2.57)
('P03', 'Almond Choco', 'Bars', 'LARGE', 9.6)
('P04', 'Raspberry Choco', 'Bars', 'LARGE', 4.09)
('P05', 'Mint Chip Choco', 'Bars', 'LARGE', 1.54)
('P06', 'Eclairs', 'Bites', 'LARGE', 2.24)
('P07', 'Drinking Coco', 'Other', 'LARGE', 1.62)
('P08', '99% Dark & Pure', 'Bars', 'LARGE', 2.47)
('P09', 'Orange Choco', 'Bars', 'LARGE', 7.14)
('P10', 'Spicy Special Slims', 'Bites', 'LARGE', 5.79)
('P11', 'After Nines', 'Bites', 'LARGE', 4.43)
('P12', 'Fruit & Nut Bars', 'Bars', 'LARGE', 1.58)
('P13', '85% Dark Bars', 'Bars', 'SMALL', 0.64)
('P14', 'White Choc', 'Other', 'SMALL', 0.16)
('P15', "Baker's Choco Chips", 'Bars', 'SMALL', 3.4)
('P16', 'Organic Choco Syrup', 'Other', 'SMALL', 1.47)
('P17', 'Caramel Stuffed Bars', 'Bars', 'SMALL', 0.54)
('P18', 'Manuka Honey Choco', 'Other', 'SMALL', 4.75)
('P19', '70% Dark Bites', 'Bites', 'SMALL', 4.97)
('P20', 'Smooth Sliky Salty', 'Bars', 'SMALL', 2.97)
('P21', 'Choco Coated Almonds', 'Bites', 'SMALL', 6.17)
('P22', 'Peanut Butter Cubes', 'Bites', 'SMALL', 3.57)

In [18]:
q11 = """
SELECT *
FROM sales order by SPID Limit 20;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q11)

for result in results:
  print(result)

MySQL Database connection successful
('SP01', 'G4', 'P04', datetime.date(2001, 1, 21), 8414, 276, 495)
('SP01', 'G4', 'P15', datetime.date(2001, 1, 21), 259, 32, 22)
('SP01', 'G5', 'P01', datetime.date(2011, 1, 21), 7238, 67, 315)
('SP01', 'G3', 'P19', datetime.date(2012, 1, 21), 490, 188, 35)
('SP01', 'G2', 'P14', datetime.date(2018, 1, 21), 2331, 38, 167)
('SP01', 'G2', 'P09', datetime.date(2022, 1, 21), 13146, 85, 1644)
('SP01', 'G4', 'P05', datetime.date(2025, 1, 21), 3143, 82, 210)
('SP01', 'G4', 'P06', datetime.date(2026, 1, 21), 9485, 140, 527)
('SP01', 'G2', 'P01', datetime.date(2027, 1, 21), 5558, 263, 192)
('SP01', 'G4', 'P12', datetime.date(2027, 1, 21), 5880, 71, 392)
('SP01', 'G3', 'P07', datetime.date(2028, 1, 21), 2968, 259, 110)
('SP01', 'G2', 'P16', datetime.date(2001, 2, 21), 10983, 185, 379)
('SP01', 'G1', 'P22', datetime.date(2002, 2, 21), 2436, 203, 94)
('SP01', 'G1', 'P02', datetime.date(2002, 2, 21), 3521, 50, 235)
('SP01', 'G2', 'P20', datetime.date(2004, 2, 21), 3724, 322, 266)
('SP01', 'G4', 'P13', datetime.date(2008, 2, 21), 6678, 24, 334)
('SP01', 'G1', 'P20', datetime.date(2008, 2, 21), 13293, 199, 665)
('SP01', 'G3', 'P17', datetime.date(2010, 2, 21), 1750, 9, 63)
('SP01', 'G4', 'P19', datetime.date(2017, 2, 21), 8099, 178, 675)
('SP01', 'G2', 'P10', datetime.date(2019, 2, 21), 4249, 19, 164)

In [11]:
q12 = """
select * from sales
where amount > 10000
order by amount desc
limit 20
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q12)

for result in results:
  print(result)

MySQL Database connection successful
('SP23', 'G4', 'P03', datetime.date(2012, 2, 21), 27146, 329, 1939)
('SP18', 'G5', 'P10', datetime.date(2022, 4, 21), 25207, 22, 1483)
('SP03', 'G5', 'P22', datetime.date(2002, 6, 21), 24633, 39, 986)
('SP18', 'G1', 'P11', datetime.date(2021, 10, 21), 24451, 472, 1112)
('SP18', 'G2', 'P16', datetime.date(2030, 3, 21), 24367, 272, 3481)
('SP24', 'G4', 'P01', datetime.date(2016, 2, 22), 23912, 211, 1993)
('SP17', 'G4', 'P08', datetime.date(2010, 3, 21), 23268, 80, 1058)
('SP09', 'G4', 'P20', datetime.date(2015, 3, 22), 23184, 123, 1221)
('SP14', 'G1', 'P01', datetime.date(2025, 2, 22), 22897, 43, 1347)
('SP03', 'G3', 'P03', datetime.date(2025, 10, 21), 22715, 16, 1420)
('SP25', 'G2', 'P02', datetime.date(2025, 5, 21), 22652, 46, 2060)
('SP16', 'G2', 'P13', datetime.date(2001, 3, 22), 22603, 32, 3229)
('SP13', 'G1', 'P14', datetime.date(2026, 11, 21), 22512, 74, 2047)
('SP16', 'G4', 'P08', datetime.date(2024, 6, 21), 22484, 38, 978)
('SP13', 'G4', 'P10', datetime.date(2025, 2, 22), 22155, 185, 1055)
('SP25', 'G3', 'P04', datetime.date(2015, 9, 21), 21861, 160, 1286)
('SP18', 'G5', 'P17', datetime.date(2021, 1, 21), 21595, 45, 1964)
('SP21', 'G6', 'P19', datetime.date(2004, 10, 21), 21588, 74, 1440)
('SP06', 'G4', 'P03', datetime.date(2006, 4, 21), 21525, 210, 1957)
('SP09', 'G6', 'P04', datetime.date(2013, 1, 22), 21490, 334, 1132)

In [13]:
q13 = """
select SaleDate, Amount from sales
where amount > 10000 and year(SaleDate) = 2022
order by amount desc
limit 20
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q13)

for result in results:
  print(result)

MySQL Database connection successful
(datetime.date(2022, 4, 21), 25207)
(datetime.date(2022, 3, 22), 20041)
(datetime.date(2022, 3, 21), 19621)
(datetime.date(2022, 3, 22), 17710)
(datetime.date(2022, 2, 22), 17661)
(datetime.date(2022, 11, 21), 17542)
(datetime.date(2022, 7, 21), 16968)
(datetime.date(2022, 11, 21), 16926)
(datetime.date(2022, 10, 21), 16870)
(datetime.date(2022, 2, 22), 16023)
(datetime.date(2022, 7, 21), 15848)
(datetime.date(2022, 12, 21), 15673)
(datetime.date(2022, 2, 21), 15351)
(datetime.date(2022, 4, 21), 15295)
(datetime.date(2022, 2, 21), 15253)
(datetime.date(2022, 1, 21), 15197)
(datetime.date(2022, 12, 21), 14959)
(datetime.date(2022, 2, 21), 14721)
(datetime.date(2022, 3, 21), 14385)
(datetime.date(2022, 10, 21), 14378)

<small id="disticnt"> disticnt <small/>

In [17]:
q14 = """
SELECT distinct(GeoID), Count(GeoID) as Hasil
FROM `sales`
group by 1
order by 1 asc
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q14)

for result in results:
  print(result)

MySQL Database connection successful
('G1', 1261)
('G2', 1242)
('G3', 1293)
('G4', 1292)
('G5', 1262)
('G6', 1267)

In [18]:
q15 = """
SELECT distinct(PID), Count(PID) as Hasil
FROM `sales`
group by 1
order by 2 desc
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q15)

for result in results:
  print(result)

MySQL Database connection successful
('P11', 355)
('P22', 355)
('P18', 353)
('P14', 353)
('P01', 352)
('P08', 351)
('P17', 351)
('P13', 349)
('P03', 348)
('P16', 347)
('P12', 347)
('P04', 347)
('P06', 346)
('P09', 345)
('P05', 344)
('P10', 342)
('P15', 342)
('P07', 341)
('P20', 340)
('P19', 338)
('P21', 336)
('P02', 335)

<small id="join"> join <small/>

In [19]:
q16 = """
SELECT *
FROM Geo
Inner Join Sales ON Geo.GeoID = Sales.GeoID order by geo asc limit 20;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q16)

for result in results:
  print(result)

MySQL Database connection successful
('G5', 'Australia', 'APAC', 'SP14', 'G5', 'P16', datetime.date(2001, 1, 21), 1036, 370, 37)
('G5', 'Australia', 'APAC', 'SP10', 'G5', 'P17', datetime.date(2001, 1, 21), 4039, 536, 176)
('G5', 'Australia', 'APAC', 'SP17', 'G5', 'P13', datetime.date(2005, 1, 21), 9730, 361, 573)
('G5', 'Australia', 'APAC', 'SP09', 'G5', 'P09', datetime.date(2006, 1, 21), 539, 10, 77)
('G5', 'Australia', 'APAC', 'SP09', 'G5', 'P13', datetime.date(2007, 1, 21), 5467, 109, 288)
('G5', 'Australia', 'APAC', 'SP22', 'G5', 'P09', datetime.date(2008, 1, 21), 3570, 61, 325)
('G5', 'Australia', 'APAC', 'SP05', 'G5', 'P04', datetime.date(2008, 1, 21), 364, 14, 21)
('G5', 'Australia', 'APAC', 'SP19', 'G5', 'P14', datetime.date(2008, 1, 21), 6496, 15, 406)
('G5', 'Australia', 'APAC', 'SP08', 'G5', 'P07', datetime.date(2008, 1, 21), 6419, 359, 257)
('G5', 'Australia', 'APAC', 'SP01', 'G5', 'P01', datetime.date(2011, 1, 21), 7238, 67, 315)
('G5', 'Australia', 'APAC', 'SP08', 'G5', 'P19', datetime.date(2012, 1, 21), 4235, 76, 283)
('G5', 'Australia', 'APAC', 'SP16', 'G5', 'P05', datetime.date(2014, 1, 21), 3598, 365, 257)
('G5', 'Australia', 'APAC', 'SP20', 'G5', 'P12', datetime.date(2014, 1, 21), 14574, 86, 810)
('G5', 'Australia', 'APAC', 'SP04', 'G5', 'P04', datetime.date(2018, 1, 21), 1428, 55, 76)
('G5', 'Australia', 'APAC', 'SP19', 'G5', 'P07', datetime.date(2018, 1, 21), 2646, 150, 116)
('G5', 'Australia', 'APAC', 'SP24', 'G5', 'P04', datetime.date(2018, 1, 21), 945, 298, 50)
('G5', 'Australia', 'APAC', 'SP06', 'G5', 'P15', datetime.date(2019, 1, 21), 742, 80, 53)
('G5', 'Australia', 'APAC', 'SP17', 'G5', 'P01', datetime.date(2021, 1, 21), 2408, 106, 90)
('G5', 'Australia', 'APAC', 'SP08', 'G5', 'P03', datetime.date(2021, 1, 21), 280, 408, 17)
('G5', 'Australia', 'APAC', 'SP07', 'G5', 'P21', datetime.date(2021, 1, 21), 2191, 65, 110)

In [20]:
q17 = """
SELECT *
FROM Sales
Right Join People ON Sales.SPID = People.SPID
limit 20
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q17)

for result in results:
  print(result)

MySQL Database connection successful
('SP01', 'G4', 'P04', datetime.date(2001, 1, 21), 8414, 276, 495, 'Barr Faughny', 'SP01', 'Yummies', 'Hyderabad')
('SP02', 'G3', 'P14', datetime.date(2001, 1, 21), 532, 317, 54, 'Dennison Crosswaite', 'SP02', 'Yummies', 'Hyderabad')
('SP12', 'G2', 'P08', datetime.date(2001, 1, 21), 5376, 178, 269, 'Karlen McCaffrey', 'SP12', 'Yummies', 'Wellington')
('SP01', 'G4', 'P15', datetime.date(2001, 1, 21), 259, 32, 22, 'Barr Faughny', 'SP01', 'Yummies', 'Hyderabad')
('SP19', 'G2', 'P18', datetime.date(2001, 1, 21), 5530, 4, 179, 'Beverie Moffet', 'SP19', 'Jucies', 'Seattle')
('SP17', 'G1', 'P13', datetime.date(2001, 1, 21), 2184, 63, 122, 'Rafaelita Blaksland', 'SP17', '', 'Wellington')
('SP20', 'G6', 'P04', datetime.date(2001, 1, 21), 1057, 295, 71, 'Oby Sorrel', 'SP20', 'Jucies', 'Seattle')
('SP14', 'G5', 'P16', datetime.date(2001, 1, 21), 1036, 370, 37, 'Dotty Strutley', 'SP14', 'Delish', 'Wellington')
('SP10', 'G5', 'P17', datetime.date(2001, 1, 21), 4039, 536, 176, 'Brien Boise', 'SP10', 'Jucies', 'Wellington')
('SP06', 'G4', 'P01', datetime.date(2001, 1, 21), 12894, 115, 478, 'Curtice Advani', 'SP06', 'Delish', 'Hyderabad')
('SP18', 'G2', 'P01', datetime.date(2001, 1, 21), 4669, 121, 180, 'Madelene Upcott', 'SP18', 'Jucies', 'Wellington')
('SP04', 'G4', 'P16', datetime.date(2001, 1, 21), 6377, 184, 246, "Wilone O'Kielt", 'SP04', 'Delish', 'Hyderabad')
('SP22', 'G3', 'P05', datetime.date(2001, 1, 21), 4599, 106, 256, 'Jehu Rudeforth', 'SP22', '', 'Seattle')
('SP22', 'G2', 'P09', datetime.date(2001, 1, 21), 2751, 228, 251, 'Jehu Rudeforth', 'SP22', '', 'Seattle')
('SP10', 'G1', 'P06', datetime.date(2001, 1, 21), 15596, 32, 975, 'Brien Boise', 'SP10', 'Jucies', 'Wellington')
('SP06', 'G1', 'P11', datetime.date(2001, 1, 21), 8561, 111, 330, 'Curtice Advani', 'SP06', 'Delish', 'Hyderabad')
('SP25', 'G6', 'P05', datetime.date(2001, 1, 21), 14273, 335, 752, 'Camilla Castle', 'SP25', 'Delish', 'Seattle')
('SP02', 'G4', 'P13', datetime.date(2001, 1, 21), 2506, 99, 148, 'Dennison Crosswaite', 'SP02', 'Yummies', 'Hyderabad')
('SP19', 'G3', 'P10', datetime.date(2001, 1, 21), 2387, 134, 89, 'Beverie Moffet', 'SP19', 'Jucies', 'Seattle')
('SP09', 'G2', 'P07', datetime.date(2001, 1, 21), 7553, 67, 280, 'Andria Kimpton', 'SP09', 'Jucies', 'Hyderabad')

In [21]:
q18 = """
SELECT S.GeoID, S.PID, P.salesperson, S.Amount, S.Boxes, S.Customers, P.Team, P.Location
FROM Sales S
LEFT Join People P ON S.SPID = P.SPID order by GeoID desc limit 20;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q18)

for result in results:
  print(result)

MySQL Database connection successful
('G6', 'P04', 'Oby Sorrel', 1057, 71, 295, 'Jucies', 'Seattle')
('G6', 'P05', 'Camilla Castle', 14273, 752, 335, 'Delish', 'Seattle')
('G6', 'P21', 'Kelci Walkden', 1988, 95, 179, 'Yummies', 'Wellington')
('G6', 'P09', 'Karlen McCaffrey', 147, 11, 9, 'Yummies', 'Wellington')
('G6', 'P12', 'Oby Sorrel', 2401, 134, 407, 'Jucies', 'Seattle')
('G6', 'P17', 'Curtice Advani', 5390, 216, 61, 'Delish', 'Hyderabad')
('G6', 'P03', 'Madelene Upcott', 1176, 66, 152, 'Jucies', 'Wellington')
('G6', 'P12', 'Madelene Upcott', 7063, 643, 250, 'Jucies', 'Wellington')
('G6', 'P11', 'Husein Augar', 6622, 276, 57, 'Yummies', 'Wellington')
('G6', 'P22', 'Jan Morforth', 7182, 378, 29, 'Delish', 'Wellington')
('G6', 'P19', 'Oby Sorrel', 637, 91, 79, 'Jucies', 'Seattle')
('G6', 'P01', 'Gunar Cockshoot', 2709, 101, 27, 'Yummies', 'Hyderabad')
('G6', 'P17', 'Kelci Walkden', 3073, 129, 137, 'Yummies', 'Wellington')
('G6', 'P04', 'Ches Bonnell', 357, 17, 185, '', 'Hyderabad')
('G6', 'P08', 'Kelci Walkden', 5124, 285, 33, 'Yummies', 'Wellington')
('G6', 'P01', 'Husein Augar', 189, 8, 123, 'Yummies', 'Wellington')
('G6', 'P03', 'Jan Morforth', 5418, 247, 287, 'Delish', 'Wellington')
('G6', 'P07', 'Ches Bonnell', 728, 32, 234, '', 'Hyderabad')
('G6', 'P01', 'Karlen McCaffrey', 6881, 222, 10, 'Yummies', 'Wellington')
('G6', 'P10', 'Ches Bonnell', 1127, 54, 97, '', 'Hyderabad')

In [22]:
q19 = """
SELECT P.PID, P.Product, P.size, P.category, S.Amount, S.Boxes
FROM products P
Right Join Sales S ON P.PID = S.PID order by Amount desc limit 20;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q19)

for result in results:
  print(result)

MySQL Database connection successful
('P03', 'Almond Choco', 'LARGE', 'Bars', 27146, 1939)
('P10', 'Spicy Special Slims', 'LARGE', 'Bites', 25207, 1483)
('P22', 'Peanut Butter Cubes', 'SMALL', 'Bites', 24633, 986)
('P11', 'After Nines', 'LARGE', 'Bites', 24451, 1112)
('P16', 'Organic Choco Syrup', 'SMALL', 'Other', 24367, 3481)
('P01', 'Milk Bars', 'LARGE', 'Bars', 23912, 1993)
('P08', '99% Dark & Pure', 'LARGE', 'Bars', 23268, 1058)
('P20', 'Smooth Sliky Salty', 'SMALL', 'Bars', 23184, 1221)
('P01', 'Milk Bars', 'LARGE', 'Bars', 22897, 1347)
('P03', 'Almond Choco', 'LARGE', 'Bars', 22715, 1420)
('P02', '50% Dark Bites', 'LARGE', 'Bites', 22652, 2060)
('P13', '85% Dark Bars', 'SMALL', 'Bars', 22603, 3229)
('P14', 'White Choc', 'SMALL', 'Other', 22512, 2047)
('P08', '99% Dark & Pure', 'LARGE', 'Bars', 22484, 978)
('P10', 'Spicy Special Slims', 'LARGE', 'Bites', 22155, 1055)
('P04', 'Raspberry Choco', 'LARGE', 'Bars', 21861, 1286)
('P17', 'Caramel Stuffed Bars', 'SMALL', 'Bars', 21595, 1964)
('P19', '70% Dark Bites', 'SMALL', 'Bites', 21588, 1440)
('P03', 'Almond Choco', 'LARGE', 'Bars', 21525, 1957)
('P04', 'Raspberry Choco', 'LARGE', 'Bars', 21490, 1132)

<small id="aggregate functions"> aggregate functions <small/>

In [23]:
q20 = """
select GeoID, sum(Amount), avg(Amount), sum(Boxes)
from sales
group by GeoID
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q20)

for result in results:
  print(result)

MySQL Database connection successful
('G1', Decimal('7310254'), Decimal('5797.1879'), Decimal('490374'))
('G2', Decimal('7012523'), Decimal('5646.1538'), Decimal('473759'))
('G3', Decimal('7350091'), Decimal('5684.5251'), Decimal('491482'))
('G4', Decimal('7435918'), Decimal('5755.3545'), Decimal('493139'))
('G5', Decimal('7263151'), Decimal('5755.2702'), Decimal('482536'))
('G6', Decimal('7189609'), Decimal('5674.5138'), Decimal('470021'))

In [24]:
q21 = """
select P.Product, sum(S.Amount) as "Total Amount"
from Sales S
join Products P ON P.PID = S.PID
group by P.Product
order by 'Total Amount' desc
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q21)

for result in results:
  print(result)

MySQL Database connection successful
('Organic Choco Syrup', Decimal('2016707'))
('Spicy Special Slims', Decimal('2004415'))
('Mint Chip Choco', Decimal('1871751'))
('Milk Bars', Decimal('1989078'))
('Choco Coated Almonds', Decimal('1980566'))
('Fruit & Nut Bars', Decimal('2013081'))
('Eclairs', Decimal('1955975'))
("Baker's Choco Chips", Decimal('1906583'))
('Drinking Coco', Decimal('1941562'))
('99% Dark & Pure', Decimal('2023070'))
('Raspberry Choco', Decimal('2090242'))
('Almond Choco', Decimal('2055627'))
('Manuka Honey Choco', Decimal('1965089'))
('After Nines', Decimal('2112502'))
('70% Dark Bites', Decimal('1941037'))
('Caramel Stuffed Bars', Decimal('2010407'))
('Smooth Sliky Salty', Decimal('1934387'))
('White Choc', Decimal('1913296'))
('85% Dark Bars', Decimal('1953063'))
('50% Dark Bites', Decimal('1991836'))
('Peanut Butter Cubes', Decimal('1992060'))
('Orange Choco', Decimal('1899212'))

In [25]:
q22 = """
select PR.category, P.Team, sum(Boxes), sum(Amount)
from sales S
join people P ON P.SPID = S.SPID
join products PR ON PR.PID = S.PID
where P.Team <> ''
group by PR.category, P.Team
order by PR.category, P.Team
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q22)

for result in results:
  print(result)

MySQL Database connection successful
('Bars', 'Delish', Decimal('456609'), Decimal('6862975'))
('Bars', 'Jucies', Decimal('340348'), Decimal('5113521'))
('Bars', 'Yummies', Decimal('406265'), Decimal('6201601'))
('Bites', 'Delish', Decimal('273424'), Decimal('4525724'))
('Bites', 'Jucies', Decimal('201838'), Decimal('3284309'))
('Bites', 'Yummies', Decimal('243030'), Decimal('4017342'))
('Other', 'Delish', Decimal('194383'), Decimal('2464455'))
('Other', 'Jucies', Decimal('145619'), Decimal('1872563'))
('Other', 'Yummies', Decimal('184056'), Decimal('2311428'))

In [26]:
q23 = """
select G.Geo, sum(Amount), avg(Amount), sum(Boxes)
from sales S
join Geo G ON S.GeoID = G.GeoID
group by G.Geo
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q23)

for result in results:
  print(result)

MySQL Database connection successful
('Australia', Decimal('7263151'), Decimal('5755.2702'), Decimal('482536'))
('Canada', Decimal('7350091'), Decimal('5684.5251'), Decimal('491482'))
('India', Decimal('7310254'), Decimal('5797.1879'), Decimal('490374'))
('New Zealand', Decimal('7435918'), Decimal('5755.3545'), Decimal('493139'))
('UK', Decimal('7189609'), Decimal('5674.5138'), Decimal('470021'))
('USA', Decimal('7012523'), Decimal('5646.1538'), Decimal('473759'))

In [27]:
q24 = """
select P.SalesPerson, S.Amount, S.Boxes, S.Boxes / Amount as 'Amount Per Box'
from sales S 
Join People P ON S.SPID = P.SPID
order by 4 desc
limit 20
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q24)

for result in results:
  print(result)

MySQL Database connection successful
('Oby Sorrel', 21, 5, Decimal('0.2381'))
('Gunar Cockshoot', 329, 66, Decimal('0.2006'))
('Ches Bonnell', 3052, 611, Decimal('0.2002'))
('Oby Sorrel', 3997, 800, Decimal('0.2002'))
('Kelci Walkden', 1064, 213, Decimal('0.2002'))
('Camilla Castle', 6041, 1209, Decimal('0.2001'))
('Van Tuxwell', 3808, 762, Decimal('0.2001'))
("Wilone O'Kielt", 12586, 2518, Decimal('0.2001'))
('Van Tuxwell', 5628, 1126, Decimal('0.2001'))
('Brien Boise', 9541, 1909, Decimal('0.2001'))
('Rafaelita Blaksland', 1659, 332, Decimal('0.2001'))
('Ches Bonnell', 8064, 1613, Decimal('0.2000'))
('Beverie Moffet', 4319, 864, Decimal('0.2000'))
('Van Tuxwell', 5369, 1074, Decimal('0.2000'))
('Kelci Walkden', 15372, 3075, Decimal('0.2000'))
('Gigi Bohling', 4774, 955, Decimal('0.2000'))
("Marney O'Breen", 8855, 1771, Decimal('0.2000'))
('Karlen McCaffrey', 6580, 1316, Decimal('0.2000'))
('Oby Sorrel', 8099, 1620, Decimal('0.2000'))
("Marney O'Breen", 735, 147, Decimal('0.2000'))

In [28]:
q25 = """
select P.SPID, P.Salesperson, count(S.Boxes)
from people P
join Sales S ON P.SPID = S.SPID
group by SPID asc
order by 3 desc
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q25)

for result in results:
  print(result)

MySQL Database connection successful
('SP03', 'Gunar Cockshoot', 315)
('SP23', 'Van Tuxwell', 314)
('SP09', 'Andria Kimpton', 312)
('SP18', 'Madelene Upcott', 312)
('SP15', 'Kelci Walkden', 310)
('SP24', 'Roddy Speechley', 310)
('SP04', "Wilone O'Kielt", 308)
('SP12', 'Karlen McCaffrey', 308)
('SP02', 'Dennison Crosswaite', 307)
('SP10', 'Brien Boise', 307)
('SP25', 'Camilla Castle', 306)
('SP19', 'Beverie Moffet', 305)
('SP01', 'Barr Faughny', 304)
('SP05', 'Gigi Bohling', 304)
('SP14', 'Dotty Strutley', 304)
('SP13', 'Jan Morforth', 303)
('SP17', 'Rafaelita Blaksland', 302)
('SP16', "Marney O'Breen", 301)
('SP22', 'Jehu Rudeforth', 301)
('SP08', 'Ches Bonnell', 300)
('SP20', 'Oby Sorrel', 300)
('SP21', 'Mallorie Waber', 300)
('SP06', 'Curtice Advani', 298)
('SP11', 'Husein Augar', 298)
('SP07', 'Kaine Padly', 288)

In [29]:
q26 = """
select S.SaleDate, S.Amount, P.SalesPerson, Pr.Product, P.Team, G.Geo
from Sales S
join People P ON P.SPID = S.SPID
join Products Pr ON Pr.PID = S.PID
join Geo G ON G.GeoID = S.GeoID
where S.Amount >500
and P.Team = ''
and G.Geo in ('New Zealand', 'India')
order by Amount desc
limit 20
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q26)

for result in results:
  print(result)

MySQL Database connection successful
(datetime.date(2010, 3, 21), 23268, 'Rafaelita Blaksland', '99% Dark & Pure', '', 'New Zealand')
(datetime.date(2013, 10, 21), 20825, 'Jehu Rudeforth', 'Orange Choco', '', 'India')
(datetime.date(2021, 1, 22), 20720, 'Ches Bonnell', 'Raspberry Choco', '', 'New Zealand')
(datetime.date(2022, 3, 22), 20041, 'Jehu Rudeforth', 'White Choc', '', 'India')
(datetime.date(2030, 8, 21), 19376, 'Jehu Rudeforth', 'After Nines', '', 'India')
(datetime.date(2013, 12, 21), 18830, 'Mallorie Waber', 'Fruit & Nut Bars', '', 'New Zealand')
(datetime.date(2008, 2, 21), 18571, 'Jehu Rudeforth', 'After Nines', '', 'New Zealand')
(datetime.date(2007, 1, 22), 18130, 'Mallorie Waber', 'Milk Bars', '', 'India')
(datetime.date(2019, 7, 21), 17591, 'Jehu Rudeforth', 'Smooth Sliky Salty', '', 'India')
(datetime.date(2013, 9, 21), 16681, 'Ches Bonnell', 'Milk Bars', '', 'India')
(datetime.date(2011, 3, 22), 16576, 'Rafaelita Blaksland', 'Mint Chip Choco', '', 'India')
(datetime.date(2023, 9, 21), 16513, 'Rafaelita Blaksland', 'Drinking Coco', '', 'India')
(datetime.date(2010, 1, 22), 16121, 'Ches Bonnell', 'Milk Bars', '', 'India')
(datetime.date(2021, 1, 22), 16072, 'Ches Bonnell', 'Peanut Butter Cubes', '', 'India')
(datetime.date(2012, 5, 21), 15603, 'Rafaelita Blaksland', 'Almond Choco', '', 'New Zealand')
(datetime.date(2019, 1, 21), 15407, 'Ches Bonnell', 'Mint Chip Choco', '', 'India')
(datetime.date(2019, 11, 21), 15407, 'Rafaelita Blaksland', 'Choco Coated Almonds', '', 'New Zealand')
(datetime.date(2017, 2, 21), 15323, 'Rafaelita Blaksland', 'White Choc', '', 'India')
(datetime.date(2012, 2, 21), 15127, 'Jehu Rudeforth', 'Peanut Butter Cubes', '', 'India')
(datetime.date(2014, 2, 22), 15092, 'Ches Bonnell', 'White Choc', '', 'New Zealand')

In [30]:
q27 = """
select P.SPID, P.Salesperson, Max(Amount)
from people P
join Sales S ON P.SPID = S.SPID
group by SPID asc
order by 3 desc
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q27)

for result in results:
  print(result)

MySQL Database connection successful
('SP23', 'Van Tuxwell', 27146)
('SP18', 'Madelene Upcott', 25207)
('SP03', 'Gunar Cockshoot', 24633)
('SP24', 'Roddy Speechley', 23912)
('SP17', 'Rafaelita Blaksland', 23268)
('SP09', 'Andria Kimpton', 23184)
('SP14', 'Dotty Strutley', 22897)
('SP25', 'Camilla Castle', 22652)
('SP16', "Marney O'Breen", 22603)
('SP13', 'Jan Morforth', 22512)
('SP21', 'Mallorie Waber', 21588)
('SP06', 'Curtice Advani', 21525)
('SP02', 'Dennison Crosswaite', 21406)
('SP15', 'Kelci Walkden', 21140)
('SP12', 'Karlen McCaffrey', 20993)
('SP22', 'Jehu Rudeforth', 20832)
('SP19', 'Beverie Moffet', 20818)
('SP08', 'Ches Bonnell', 20720)
('SP01', 'Barr Faughny', 20671)
('SP04', "Wilone O'Kielt", 20146)
('SP10', 'Brien Boise', 20132)
('SP05', 'Gigi Bohling', 19817)
('SP11', 'Husein Augar', 19579)
('SP07', 'Kaine Padly', 19523)
('SP20', 'Oby Sorrel', 16947)

In [40]:
q28 = """
SELECT MAX(Amount)
FROM `sales`
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q28)

for result in results:
  print(result)

MySQL Database connection successful
(27146,)

In [41]:
q29 = """
SELECT MIN(Amount)
FROM `sales`
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q29)

for result in results:
  print(result)

MySQL Database connection successful
(0,)

In [44]:
q30 = """
SELECT Amount, MAX(Amount)
FROM `sales` 
group by 1
order by amount desc
limit 20
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q30)

for result in results:
  print(result)

MySQL Database connection successful
(27146, 27146)
(25207, 25207)
(24633, 24633)
(24451, 24451)
(24367, 24367)
(23912, 23912)
(23268, 23268)
(23184, 23184)
(22897, 22897)
(22715, 22715)
(22652, 22652)
(22603, 22603)
(22512, 22512)
(22484, 22484)
(22155, 22155)
(21861, 21861)
(21595, 21595)
(21588, 21588)
(21525, 21525)
(21490, 21490)

<small id="operator"> operator <small/>

In [46]:
q31 = """
select GeoID, Amount, Boxes 
from sales
where boxes >0 and boxes <=50 order by GeoID asc limit 20
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q31)

for result in results:
  print(result)

MySQL Database connection successful
('G1', 644, 34)
('G1', 238, 11)
('G1', 1029, 47)
('G1', 126, 13)
('G1', 644, 30)
('G1', 749, 35)
('G1', 686, 46)
('G1', 630, 28)
('G1', 63, 7)
('G1', 182, 7)
('G1', 294, 17)
('G1', 49, 3)
('G1', 623, 22)
('G1', 203, 19)
('G1', 574, 34)
('G1', 434, 37)
('G1', 1085, 46)
('G1', 21, 1)
('G1', 350, 25)
('G1', 749, 28)

In [47]:
q32 = """
select SaleDate, Amount from sales
where amount > 10000 and year(SaleDate) = 2022
order by Amount desc limit 20;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q32)

for result in results:
  print(result)

MySQL Database connection successful
(datetime.date(2022, 4, 21), 25207)
(datetime.date(2022, 3, 22), 20041)
(datetime.date(2022, 3, 21), 19621)
(datetime.date(2022, 3, 22), 17710)
(datetime.date(2022, 2, 22), 17661)
(datetime.date(2022, 11, 21), 17542)
(datetime.date(2022, 7, 21), 16968)
(datetime.date(2022, 11, 21), 16926)
(datetime.date(2022, 10, 21), 16870)
(datetime.date(2022, 2, 22), 16023)
(datetime.date(2022, 7, 21), 15848)
(datetime.date(2022, 12, 21), 15673)
(datetime.date(2022, 2, 21), 15351)
(datetime.date(2022, 4, 21), 15295)
(datetime.date(2022, 2, 21), 15253)
(datetime.date(2022, 1, 21), 15197)
(datetime.date(2022, 12, 21), 14959)
(datetime.date(2022, 2, 21), 14721)
(datetime.date(2022, 3, 21), 14385)
(datetime.date(2022, 10, 21), 14378)

In [48]:
q33 = """
select PID, boxes
from sales
where boxes
between 1000 and 2000 order by boxes asc limit 20
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q33)

for result in results:
  print(result)

MySQL Database connection successful
('P09', 1000)
('P18', 1002)
('P16', 1003)
('P22', 1005)
('P09', 1006)
('P13', 1006)
('P17', 1007)
('P14', 1008)
('P01', 1008)
('P10', 1008)
('P05', 1010)
('P10', 1011)
('P21', 1012)
('P21', 1013)
('P17', 1013)
('P14', 1015)
('P09', 1015)
('P22', 1017)
('P22', 1017)
('P12', 1019)

<small id="like"> like <small/>

In [50]:
q34 = """
select * from people
where salesperson like 'B%';
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q34)

for result in results:
  print(result)

MySQL Database connection successful
('Barr Faughny', 'SP01', 'Yummies', 'Hyderabad')
('Brien Boise', 'SP10', 'Jucies', 'Wellington')
('Beverie Moffet', 'SP19', 'Jucies', 'Seattle')
('Benny Karolovsky', 'SP32', 'Jucies', 'Paris')

In [52]:
q35 = """
select * from people
where salesperson like '%B%';
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q35)

for result in results:
  print(result)

MySQL Database connection successful
('Barr Faughny', 'SP01', 'Yummies', 'Hyderabad')
('Gigi Bohling', 'SP05', 'Delish', 'Hyderabad')
('Ches Bonnell', 'SP08', '', 'Hyderabad')
('Brien Boise', 'SP10', 'Jucies', 'Wellington')
("Marney O'Breen", 'SP16', 'Jucies', 'Wellington')
('Rafaelita Blaksland', 'SP17', '', 'Wellington')
('Beverie Moffet', 'SP19', 'Jucies', 'Seattle')
('Oby Sorrel', 'SP20', 'Jucies', 'Seattle')
('Mallorie Waber', 'SP21', '', 'Seattle')
('Ebonee Roxburgh', 'SP28', '', 'Paris')
('Benny Karolovsky', 'SP32', 'Jucies', 'Paris')

<small id="case when"> case when <small/>

In [54]:
q36 = """
select 	SaleDate, Amount,
		case 	when amount < 1000 then 'Under 1k'
				when amount < 5000 then 'Under 5k'
                when amount < 10000 then 'Under 10k'
			else '10k or more'
		end as 'Amount category'
from sales
limit 20
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q36)

for result in results:
  print(result)

MySQL Database connection successful
(datetime.date(2001, 1, 21), 8414, 'Under 10k')
(datetime.date(2001, 1, 21), 532, 'Under 1k')
(datetime.date(2001, 1, 21), 5376, 'Under 10k')
(datetime.date(2001, 1, 21), 259, 'Under 1k')
(datetime.date(2001, 1, 21), 5530, 'Under 10k')
(datetime.date(2001, 1, 21), 2184, 'Under 5k')
(datetime.date(2001, 1, 21), 1057, 'Under 5k')
(datetime.date(2001, 1, 21), 1036, 'Under 5k')
(datetime.date(2001, 1, 21), 4039, 'Under 5k')
(datetime.date(2001, 1, 21), 12894, '10k or more')
(datetime.date(2001, 1, 21), 4669, 'Under 5k')
(datetime.date(2001, 1, 21), 6377, 'Under 10k')
(datetime.date(2001, 1, 21), 4599, 'Under 5k')
(datetime.date(2001, 1, 21), 2751, 'Under 5k')
(datetime.date(2001, 1, 21), 15596, '10k or more')
(datetime.date(2001, 1, 21), 8561, 'Under 10k')
(datetime.date(2001, 1, 21), 14273, '10k or more')
(datetime.date(2001, 1, 21), 2506, 'Under 5k')
(datetime.date(2001, 1, 21), 2387, 'Under 5k')
(datetime.date(2001, 1, 21), 7553, 'Under 10k')